In [12]:
import pandas as pd

exams_df = pd.read_excel('C:\\Users\\buhle\\Downloads\\Data set\\exam scores.xlsx')
exams_df

,Gender,Race/Ethnicity,Parental level of education,Math score,Reading score,Writing score
0,female,Indian,College,59,70,78
1,male,Indian,Diploma,96,93,87
2,female,Indian,College,57,76,77
3,male,White,College,70,70,63
4,female,Indian,Diploma,83,85,86
...,...,...,...,...,...,...
115,female,Indian,Degree,98,95,100
116,female,Indian,High school,90,96,88
117,male,Coloured,High school,64,71,68
118,female,White,High school,38,55,52
119,female,White,Degree,84,91,93

In [19]:
#Converting string to interger
exams_df['Gender'] = exams_df['Gender'].replace(['female'], '1')
exams_df['Gender'] = exams_df['Gender'].replace(['male'], '0')

exams_df['Race/Ethnicity'] = exams_df['Race/Ethnicity'].replace(['African', 'White', 'Coloured', 'Indian'], ['1', '2', '3','4'])
exams_df['Parental level of education'] = exams_df['Parental level of education'].replace(['High school', 'College', 'Diploma', 'Degree',"Master's Degree"], ['1', '2', '3','4','5'])

exams_df

,Gender,Race/Ethnicity,Parental level of education,Math score,Reading score,Writing score
0,1,4,2,59,70,78
1,0,4,3,96,93,87
2,1,4,2,57,76,77
3,0,2,2,70,70,63
4,1,4,3,83,85,86
...,...,...,...,...,...,...
115,1,4,4,98,95,100
116,1,4,1,90,96,88
117,0,3,1,64,71,68
118,1,2,1,38,55,52
119,1,2,4,84,91,93

In [22]:
exams_df.describe()

       Math score  Reading score  Writing score
count   120.00000     120.000000     120.000000
mean     69.65000      72.333333      70.850000
std      15.20319      14.119141      14.490594
min      23.00000      33.000000      33.000000
25%      61.75000      64.750000      60.750000
50%      69.00000      74.000000      73.500000
75%      80.00000      82.000000      80.250000
max     100.00000      97.000000     100.000000